---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryWithSpacing
source: html/3e33cb9d-6535-cb73-12ab-d8949640d94d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryWithSpacing Property

"Layer Summary"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryWithSpacing { get; }
```